{"article_id": "post-2281667", "artile_title": "AR/VR Weekly: Microsoft charges in", "story_url": "https://venturebeat.com/2017/10/04/arvr-weekly-microsoft-charges-in/", "time": "2017-10-04T20:47:45+00:00", "author": "Jason Wilson", "content": ["Well, well, well, look who is today’s hero in virtual reality world. No, it’s not Facebook. It’s not HTC or even Sony. It’s … Microsoft, and it signals that one of the other big megacorps in tech is ready to dive deeper into the emerging scene around VR, augmented reality, and mixed reality.", "Tuesday, Microsoft announced ", "it had acquired the AltspaceVR team", " as part of its push into mixed reality, it is working with ", "Samsung on the Odyssey mixed reality headset", ", and integration with SteamVR (meaning its library of apps and games will work with this device). Microsoft dubs mixed reality headsets as gear that can work with VR or AR.", "Right now, ", "AR appears to on the rise", ", thanks to Apple’s ARKit and Google’s ARCore. These work with hundreds of millions of devices people already own, whereas VR right now requires pricey headsets and PCs powerful enough to run the software for this new reality.", "Is Microsoft trying to play it safe by making devices that run AR and VR? Or does the Windows and Xbox company get that marrying these options together will produce a transformative technology, one that does more than either VR or AR can do alone?", "For AR/VR coverage, send news tips to ", "Dean Takahashi", " and ", "Jeff Grubb", " (for those that cross over into PC gaming). Please send guest post submissions to ", "Rowan Kaiser", ". Please be sure to visit our ", "AR/VR Channel", ".", "—Jason Wilson, GamesBeat managing editor", "P.S. ", "Let’s hang out in the VR Rec Room", " this week.", "Microsoft resuscitates AltspaceVR for social mixed reality", "Microsoft announced today that it has acquired the AltspaceVR team as it announced its big initiative to created a hardware and software ecosystem around Windows mixed reality headsets. Microsoft didn’t explain the terms of the deal, saying only that AltspaceVR is joining Microsoft. Microsoft calls the emerging technology “mixed reality” to encompass both augmented reality […]", "Samsung’s Windows Mixed Reality headset Odyssey ships November 6 for $499", "At its Windows Mixed Reality event today, Microsoft made a slew of announcements, including that it has a new partner: Samsung. The South Korean company is developing its own Windows Mixed Reality headset dubbed the Samsung HMD Odyssey. Shipping on November 6, the headset will be available in a bundle with motion controllers for $499. “When […]", "ARKit and ARCore are leaving VR in the rearview mirror", "AR/VR has become a two speed market, with mobile AR set to have over twice the number of users at launch in 2017 than the entire AR/VR headset market by 2021. Apple ARKit, Google ARCore, and Facebook’s Camera Effects Platform could have 900 million users by the end of 2018, with their launch changing the trajectory […]", "Vuforia 7 helps augmented reality blend into real life", "Augmented reality tech company Vuforia is announcing a new version of its augmented reality platform that enables more seamless integration of AR into real-world environments. Jay Wright, president of Needham, Massachusetts-based Vuforia said that Vuforia 7 has something called “ground plane,” which enables developers to create planes that fit into the real world and help […]", "Intel makes the case for wireless PC-based high-end virtual reality", "Intel recently hosted a 100-year-old man at its virtual reality lab in Hillsboro, Oregon. Lyle Becker was a big fan of the VR flight simulator, which reminded him of the planes that he flew in World War II. That kind of first-time experience evokes a sense of wonder at the immersiveness of VR, and that’s why […]", "Varjo raises $8.2 million to boost its high-res VR headset", "EXCLUSIVE: Varjo, a Finnish company that’s working on an ultra high-fidelity mixed reality headset, announced today that it has raised an $8.2 million series A round to propel it forward as it works toward the launch of its first developer kits. EQT Ventures led the round, with participation from Lifeline Ventures, the Venture Reality Fund, Presence […]", "Exclusive: The Well Is A Gorgeous RPG From Turtle Rock Studios", "After about 15 minutes exploring the newest virtual world from Turtle Rock Studios, I emerged from the forest I was journeying through and came into a clearing. I moved out to the edge of a lake, where light broke through the clouds above and descended onto the scene. I paused, took a deep breath, and just marveled. The Well is a beautiful game. ", "(via UploadVR)", "Writing for VR: The Definitive Guide to VR Storytelling", "In August, VRScout & VR Playhouse partnered with YouTube Space LA to put on the “VR Creator Lab,” a 3-month intensive for a select group of YouTube content creators looking to enhance their VR/360° output. An overview and guide to immersive writing and storytelling was included as a part of this lab. ", "(via VR Scout)", "Oculus Rift Closes in on Steam Majority Market Share", "According to the latest figures from Steam’s Hardware & Software Survey, the Oculus Rift has picked up an additional 3.1% of the market share of VR headsets on Steam. On the trail end of a major summer sale, the headset has set its new record high for the third month in a row. The HTC Vive maintains the majority with 50.2% share of headsets in use on Steam, but the Rift looms near. ", "(via Road to VR)", "Snapchat will put Jeff Koons’ art installations in augmented reality", "Snapchat plans to launch a new art initiative tomorrow aimed at using augmented reality to feature art installations around the world. A website, ", "art.snapchat.com", ", mysteriously spawned a countdown clock this afternoon, and a snippet of javascript underlying the page appears to confirm that the reveal is a collaboration with renowned artist and big Snapchat fan Jeff Koons. ", "(via The Verge)", "Country required", "*By checking this box, you are confirming you are an adult 18 years or older and you agree to Intel contacting you with marketing-related emails or by telephone. You may unsubscribe at any time. Intel’s web sites and communications are subject to our ", "Privacy Notice", " and ", "Terms of Use", "."]}
{"article_id": "post-2277602", "artile_title": "Intel makes the case for wireless PC-based high-end virtual reality", "story_url": "https://venturebeat.com/2017/10/01/intel-makes-the-case-for-wireless-pc-based-high-end-virtual-reality/", "time": "2017-10-01T10:25:18+00:00", "author": "Dean Takahashi", "content": ["Intel", " recently hosted a ", "100-year-old man", " at its virtual reality lab in Hillsboro, Oregon. Lyle Becker was a big fan of the VR flight simulator, which reminded him of the planes that he flew in World War II. That kind of first-time experience evokes a sense of wonder at the immersiveness of VR, and that’s why Kim Pallister, director of VR excellence at Intel, believes so much that VR will be a transformative medium.", "While VR is off to a slow start, Pallister believes that it will catch on in the long run. Intel recently pivoted away from a tech demo that it called ", "Project Alloy", ", a stand-alone VR headset, to something entirely different. The first generation of VR headsets, such as the Oculus Rift and the HTC Vive, are connected to powerful personal computers via wires. Everybody wants those wires to go away, but how you tackle the issue matters.", "Pallister said Intel tried at first to put the processing power in the headset itself so that you don’t have to connect a wire to a PC. But the company also worked on connecting the headset display to a PC via a wireless technology. Pallister thinks that will deliver a much better experience.", "The ", "WiGig wireless networking technology", ", which uses a short-range 60-gigahertz radio, can transfer data at fast enough rates to feed VR imagery from a PC to the display in a VR headset. With the WiGig connection, VR headset makers will be able to exploit the extra processing power available in a full desktop computer, rather than a more limited processor that has to run on battery power in a compact headset.", "I recently joined a small group of journalists who jointly interviewed Pallister. We talked about Becker, the immersive nature of VR, Project Alloy, WiGig, and Intel’s partnership with ", "Blueprint Reality on a VR presentation technology", ". Here’s an edited transcript of our interview.", "Above: Kim Pallister runs a VR lab at Intel.", "GamesBeat: I saw that video of the ", "100-year-old man visiting", " [the VR lab].", "Kim Pallister:", " That was in my lab up in Oregon. That was so much fun. We had a guy based in Oregon. His daughter is friends with the ops manager on my team. She said, “Hey, my dad is really into tech. He’s been hearing about VR, and I know you work on that.” We said, “Bring him by!” We have this open — the lab is behind locked doors, but there’s a “knock for VR demos” sign up, and we bring people in all the time. People bring their kids in. It’s a bit of a zoo sometimes.", "We brought this guy in. He’s 100 years old. If I’m as spry as he is at 100 years — the guy came booking into the lab. He’s in great shape. We put together some demos for him to film it and make a thing out of it. He was a pilot, a commercial pilot, and a pilot in World War II. He flew these supply routes that went from Burma over the high mountains in southeast Asia. It was known to be a pretty dangerous route. If you took the wrong route in the dark, you’d hit a mountain you couldn’t get over. We thought, “Hey, we’ll put him in some flight sims and see what he thinks.”", "The one question we asked him was — he was born in 1917. You’ve seen the advent of television, the advent of computers, the advent of the internet. You’ve seen the advent of commercial flight. So what’s the one technology you think was the biggest thing? You’d think maybe the internet, maybe computers. Maybe that’s my bias because I work at Intel. But he says, “Without a question, GPS.” As a pilot, seeing the world before and after, that’s the biggest delta.", "GamesBeat: Do you work with ", "Project Alloy", "?", "Pallister:", " The team that worked on that is the other lab down in Santa Clara. They’re the group that worked on all our sensing technologies. It’s a different team, but I work with those guys all the time. We’re trying a lot of different stuff. There are ways they’re related. With Alloy we said, “We have this great sensing technology. We have this high-performance PC technology. Let’s see how far we can push the envelope of putting it all in one form factor.”", "We realized this is not necessarily the optimal form factor. We learned a lot of things. We think both the inside-out tracking technology and the 3D depth sensing technology are absolutely applicable across a lot of VR areas. But the way we saw the price and performance versus form factor and the fact we were getting increasing confidence on the WiGig side of things — the best way to deliver a high-performance PC experience is to wirelessly talk to a high-performance PC plugged into a wall outlet.", "GamesBeat: Is the dev kit for Alloy still supposed to come out this year?", "Pallister:", " I think we’ve said we’re not necessarily doing it. We haven’t seen that much interest. All the technologies are still applicable, so we’re looking at ways to deliver those. Guys on my team are taking that same inside-out tracking tech and integrating it into the smartphone demo you saw there. We’re working on that now. The tech is still very much being worked on, but we’ve seen there isn’t necessarily a good fit for bulky-form-factor PC on your head. If you want the PC-quality experience, you’re better off with a full-powered PC and doing it wirelessly.", "All the technology components are still there. But bringing it to market as-is, that was never our intent. It was a proof of concept to try out all these different things. We saw that you don’t want to have the wire and that the PC experience can deliver a more rich experience than what you can deliver on your phone. One way is to say, “How much PC can we deliver in something you wear on your head?” Another is to say, “How do I remotely deliver the signal from the PC wirelessly?” The latter turned out to have more legs.", "Above: Intel CEO Brian Krzanich shows off Project Alloy at CES.", "GamesBeat: It seems like more people are still pursuing the stand-alone headsets, though.", "Pallister:", " There are people working on them. Facebook talked about theirs. The Oculus guys talked about theirs. There will be a place for those things. Even putting our position in PCs aside, I think we’re quite a ways off still from people doing enough VR that buying a dedicated appliance that does nothing but VR makes sense.", "You can imagine certain verticals where it makes sense. Something you use in a retail outlet to demo products to people, something like that. But for all these other spaces, whether it’s smartphone based or PC based, you have this Swiss-army-knife platform you use for a bunch of things and therefore, you can justify spending — what’s Apple charging for the latest phone? $1000? Or you can justify a high-end PC. But are you doing enough VR that you can justify that price? If you can’t, you end up putting less compute in there, and you deliver a less good experience.", "It’s not surprising that people are working on that. I think they’ll have their place. But our bet right now is that the biggest employment you’re going to see with these things is on general-purpose compute platforms, whether it’s a phone at the low end or a high-end PC or something on the spectrum in between.", "GamesBeat: You don’t think there’s too much room for mixed reality, then?", "Pallister:", " That’s a different question. You can do MR or AR or pick your mix of terminology, things along that spectrum. Those will also have ways to do it in a dedicated platform and ways to do it in a general-purpose platform that you’re then either putting into a headset or wirelessly talking to a headset or something.", "An example might be, you already have the ARKit stuff people are doing on phones. One could imagine somebody putting something like that up either on through-the-display AR, or — people are doing the kind of reflective, “Let’s mount the phone like this with a half-mirror visor.” That’ll be the Google Cardboard, Gear VR approach. Then, there are people already doing PC-connected headsets of some kind, which will then say, “I’ll use this open platform for development and leveraging the compute power there.” You don’t need to do a dedicated device if you’re going to do MR. Certainly, there’s room for it. HoloLens is a great example.", "Above: Lyle Becker tries out VR for the first time.", "GamesBeat: Do you have a road map for the launch at this point?", "Pallister:", " No. What we’ve said is that HTC has announced that they’re doing something. It’s up to them to announce when. They’ve said they’re not saying when yet or how much. We’d like them to say something soon, but they tend to announce things on a very short runway.", "GamesBeat: Obviously the TPCAST is available for pre-orders now.", "Pallister:", " Yeah, it is. We believe the WiGig solution is going to be better. But you guys will have to try it when it comes out.", "GamesBeat: Are you completely in line with the Microsoft MR event?", "Pallister:", " As much as we’re always aligned with Microsoft. We’ve been working really hard with them on a bunch of stuff there. Myself and a number of people went in there a couple of years ago and said, “OK, VR is happening. Where is the DirectX of VR? What are we going to do?” They formulated their plan, and we got behind it in a big way.", "In some ways, what they’re doing is their own offering, very much along the lines of what Oculus or HTC offers. It’s a high-end gaming headset instead of offering single controllers. A thing we’re doing that’s different, they’ve made a deliberate effort to scale down into a set of experiences that will run well on mainstream PCs. That’s something we’ve had whole teams of dedicated engineers working hard on. It’s a collaboration between us doing the right power/performance profiling and custom drivers and optimizations on pieces of code we run and then doing a set of vectors of scalability and different knobs and sliders within their rendering stack and their applications.", "I’m excited about it. We have a bunch of the headsets in-house now. We’ve been using their desktop shell. We have versions of Minecraft running on 15-watt notebooks at full framerate. It’s going to be great.", "GamesBeat: They’ve confused things a bit with the term “mixed reality.”", "Pallister:", " Yeah, as marketing people are sometimes wont to do.", "GamesBeat: We’ve seen some price movement this summer, which is good. It seems like we’re still waiting for the point where it’s in line with other consumer electronics devices — $299, $399 — where someone can try out VR, have a great time, and not get hit by sticker shock when they find out how much their own headset would cost.", "Pallister:", " That’s the goal with what we and Microsoft are trying to do. Can you take a sub-$300 headset and say, “This will work on the notebook you were going to buy, anyway?” You don’t have to change the notebook you were going to buy and get a high-end gaming machine. You can buy the notebook you wanted anyway and have a great set of experiences. If you want to play high-end 3D games, if you want to play Raw Data, then you’ll buy a different machine. If you want to play Minecraft, though, it’s fine."]}
{"article_id": "post-2280349", "artile_title": "4 ways Midwestern cities like Omaha can reel in young tech workers", "story_url": "https://venturebeat.com/2017/10/02/4-ways-midwestern-cities-like-omaha-can-reel-in-young-tech-workers/", "time": "2017-10-02T12:20:54+00:00", "author": "Rebecca Stavick, Do Space", "content": ["I attended the ", "Make / Happen", " conference in Omaha last week. The theme of the conference challenged attendees to become “doers” because, as the event’s mission statement says:", "Only you can make leadership happen. Be the leader you’ve been waiting for and shake up the status quo.", "Lol, OK. Challenge accepted.", "At the opening session, facilitators asked the crowd: “What would you do to solve the brain drain problem in Omaha if you had $100 million?”", "Brain drain, of course, refers to the movement of ", "human capital", " away from a particular area. In other words, our young, educated, talented people are leaving Nebraska and not coming back.", "If you pair this issue with a lack of “brain gain” — attracting talented people to a particular area — then the lack of human capital in Nebraska means we’ve got a serious economic problem on our hands. Businesses won’t move here. Businesses can’t stay here. Jobs go away. You get the picture.", "But I found the “$100 million” aspect of the question to be kinda odd, as solving the brain drain problem cannot be done with money alone. We must consider how the experience of living here influences why people leave, or why they stay.", "I write this from the perspective of someone who fits the precise demographic that Omaha is hoping to attract/retain: techie, millennial, well-educated, successful. Here’s what I think we need to do to reverse brain drain and increase brain gain in Omaha — and by extension, the Heartland in general.", "Omaha is a corporate town. This isn’t inherently good or bad, but we must recognize that the hip millennials we’re trying to attract here don’t want to be corporate. Even supposedly edgy conferences like the Make / Happen conference featured a lineup of all-white, all-male corporate CEOs as the highlight of the event. This 100 percent supports the status quo that the conference begs us to challenge.", "It’s not that Omaha has to become ", "less corporate", ", but we do need to ", "reshape corporate culture to better match the values of the millennial generation", ". For instance, I would have loved to see a panel with those very same Fortune 1000 CEOs sitting next to women and people of color who are local CEOs, all having a lively conversation about leadership in the Omaha business community.", "Millennials are socially conscious like no other generation, and we care about things like inclusion and diversity. Further support of cultural events (like ", "Maha", ") as well as support for the startup community can also chill out the corporate-y feel in Omaha.", "In conversation, Omahans rarely speak ill of their city, and when someone says something negative about Omaha, others will quickly follow up with a positive comment.", "Even though I’m from the Midwest, I’ve always found the Nebraska Nice mindset to be a little strange. Our insistence to say only nice things or say nothing at all is problematic because we cannot begin to solve problems in our community if we refuse to talk about them. Our unwillingness to challenge one another — whether that’s friendly debate or constructive criticism — stifles creativity, innovation, and progress in our city.", "But it’s more than just that. Young, ambitious people need problems to solve, and if we feed them the message that Omaha is perfect, what incentive would they have to stay or to move here? What if our messaging to young people is more like “Hey, Omaha isn’t perfect, we have real problems, and we need your help to solve them”?", "It wasn’t long ago that Nebraska was ranked ", "the most dangerous place in America for black people to live", ", which is a tragic truth that we so often leave out of our conversations on how wonderful it is to live in Omaha. Institutionalized racism has ensured that the American Dream is often out of reach for people of color in our city. Just read this quote from a black young professional, as ", "cited in this recent survey", ":", "I would choose to live somewhere else because my children cannot be what they do not see. My child would not have the ability to see Black doctors, lawyers, CEOs, community leaders, etc. Why would I choose to raise a family in this environment when there are other cities that do not struggle with this representation?", "We all must take ownership of racial and social equity in Omaha because it’s the moral and ethical thing to do, and because we can’t have a conversation about talent in Nebraska without recognizing that the absence of a successful, healthy black middle class is a problem of our own making.", "Imagine if Omaha’s public schools were all brand-new. And we had beautiful, updated libraries. And the best parks of any city in the country. What if Omaha was a “smart city” with city services and programs seamlessly integrated with technology?", "The livability of our city directly affects whether people stay or go. But we don’t have to reinvent the wheel when it comes to civic innovation, because we can steal best practices from other cities across the country that have already solved the problems that we face today.", "On the other side of that coin, we can look at what ", "isn’t", " working in other cities to create a competitive advantage in attracting talent. Silicon Valley, for instance, has a serious problem retaining women in the tech sector. What if Omaha implemented a citywide strategy — possibly through shared policies and training — to establish Omaha as the most female-friendly business environment in the United States?", "Don’t tell me that the exhausted, underappreciated, brilliant women in the tech field wouldn’t flee the coasts for the opportunity to have a better life here. Identifying specific ways we can differentiate Omaha from other Midwestern cities will give us the edge we need to attract talented people to our city.", "Rebecca Stavick is the executive director of ", "Do Space", ", a community technology library in Omaha, Nebraska dedicated to empowering community through access to technology and innovative learning experiences. This post first appeared on her ", "Medium blog", "."]}
{"article_id": "post-2280675", "artile_title": "BlackBerry is moving from Nasdaq to the New York Stock Exchange on October 16", "story_url": "https://venturebeat.com/2017/10/03/blackberry-is-moving-from-the-nasdaq-to-new-york-stock-exchange-on-october-16/", "time": "2017-10-03T06:32:23+00:00", "author": "Paul Sawers", "content": ["BlackBerry has announced plans to move its shares from Nasdaq to the New York Stock Exchange (NYSE) on October 16.", "The Canadian tech firm hasn’t given a specific reason for upping sticks and moving its shares to another stock market, but as the company continues to ", "shift away from its mobile hardware roots", " and define itself as a software and services company, it’s as good a time as any to start afresh on a new exchange.", "“Many of the world’s greatest brands, including a large number of our customers and partners, are listed on the NYSE, and we look forward to joining them,” said BlackBerry CEO and executive chairman John Chen, in a ", "press release", ". “As we continue to advance our growth strategy, we believe that our partnership with the NYSE will further raise the profile of our company and strengthen the value of our BlackBerry Secure brand.”", "BlackBerry has been listed on the Toronto Stock Exchange (TSX) since 1998, and since 1999 it’s been on Nasdaq, where its shares enjoyed a peak of around $230 in 2007 under its former Research in Motion (RIM) moniker. With the rise of Android and iOS, BlackBerry’s shares have been in free fall in the years since, hitting a low of around $6 in 2013 shortly after the ", "company changed its name to BlackBerry", ". Today, the company’s stock hovers around the $11 mark.", "The move to the NYSE will also see BlackBerry ditch its BBRY Nasdaq ticker symbol in favor for “BB,” the same as it is on the TSX.", "To mark the momentous occasion, which will likely be witnessed by at least a few people, BlackBerry representatives will ring the NYSE opening bell on October 16, at 9.30 a.m. ET."]}
{"article_id": "post-2279358", "artile_title": "European Twilio rival MessageBird raises $60 million from Accel, Atomico, and Y Combinator", "story_url": "https://venturebeat.com/2017/10/03/european-twilio-rival-messagebird-raises-60-million-from-accel-atomico-and-y-combinator/", "time": "2017-10-03T07:01:20+00:00", "author": "Paul Sawers", "content": ["MessageBird", ", a European Twilio rival that says it bootstrapped its way to profitabilty early on, has raised its first notable equity financing via a $60 million series A round led by Accel, with participation from London-based Atomico and Y Combinator.", "Founded out of Amsterdam in 2011, MessageBird had until now only received a small $120,000 “seed” investment as part of its participation in the Y Combinator accelerator program last year. Today’s announcement heralds one of the biggest ever series A investments in a European software startup — though it still lags behind that of U.K.-based payments company Powa, which ", "raised a $76 million series A round", " four years ago before eventually ", "going bust last year", ".", "While there are some differences between MessageBird and Twilio, the two are broadly similar insofar as they both offer developers and companies a cloud-based communications platform that enables them to bring chat and messaging functionality to their own products through APIs (application programming interfaces). By combining software, cloud, and APIs, this approach circumvents the need for costly hardware infrastructure, and makes it more cost-effective for companies to introduce text- and voice-based features to their own services.", "MessageBird hasn’t grabbed the same kinds of headlines as its San Francisco counterpart Twilio, which was founded in 2008 and finally ", "went public on the New York Stock Exchange", " (NYSE) last June after raising more than $230 million in funding.", "While Twilio and MessageBird are competitors, the former has a significant head start in the U.S., a market the latter is now targeting for growth. So, did Twilio’s IPO last year raise a broader interest in the sector?", "“It definitely raised awareness in the U.S. of the cloud communications space as a whole,” explained MessageBird founder and CEO Robert Vis, in an interview with VentureBeat. “The uptake we saw was mainly from large enterprises wanting to reach their customers in the greatest possible number of geographies around the world available today.”", "So far, MessageBird has offered a ", "chat API", " for integrating messaging services such as Telegram, Messenger, WeChat, and Line into third-party apps or websites. Its ", "messaging API", " powers SMS-based in-app communications and it’s also working on a video API that’s currently in the final stages of beta testing. With another $60 million in the bank, MessageBird is today officially launching its ", "voice API", " — which has already been available for several weeks in beta — to allow businesses to build voice calling into their own services. This is similar to what Twilio has offered for many years already.", "“We’ve already built the world’s largest and most reliable text message API service for enterprises; now we are raising capital from the two leading investors in Silicon Valley and Europe to expand our voice infrastructure and sell our services into the enterprise market,” said Vis.", "Above: Robert Vis, MessageBird", "For a company that specializes in cloud-based communications, the delay in offering a voice API seems like a huge omission on the surface. Surely, this has significantly hindered MessageBird’s growth so far?", "“In our case, we saw customers using us for SMS and just not using us for voice because we didn’t offer it before,” said Vis. “The need for the voice API really is driven by our customers, who wanted us to provide the same global security and cost advantages on voice that we have been doing for SMS for some time now. We are now able to leverage our direct carrier connections on voice as well as SMS. Being bootstrapped teaches you to focus on where the most growth is coming from, and up to now that has always been our SMS products. But the need from our customers was clear — so we built it.”", "MessageBird claims it has been profitable since its inception and said that it’s on course to hit a $100 million revenue run rate this year. That is pretty impressive. By way of comparison, Twilio had raised north of $100 million in outside funding by the time it was reporting ", "a $100 million run rate in 2014", ", and this came shortly before it raised ", "an additional $130 million", ".", "MessageBird said that it already counts 15,000 customers globally, including DoorDash, SAP, Huawei, Amber Alert, and Heineken. One particularly notable name in its roster is Uber, which Twilio has long claimed as a client of its own. ", "But Twilio recently revealed", " that Uber was reducing its dependency on Twilio’s technology, a move that caused Twilio’s ", "stock to nosedive", ".", "Anyone who’s ever used Uber will likely take for granted the app’s speedy messaging functionality. You’ll also note that it’s possible to chat verbally with a driver through the app, rather than having to share telephone numbers manually over SMS.", "“The magic of using cloud communications to power this interaction is that both customer and rider are automatically provided with a virtual number, which means both sides of the call are anonymized,” noted Vis. “Driver and customer never see each other’s real number.”", "With tens of millions of users globally, such a system requires a reliable infrastructure, and it’s much easier — even for heavily funded companies such as Uber — to outsource some of these service, rather than building it all in-house.", "“We work with large companies that cannot afford compromised communications,” continued Vis. “The quality of your communications is a direct reflection on the caliber of your business. If you’re on a sales call and that connection is poor, you won’t close the deal. Dropped calls result in missed opportunities and lost business.”", "Another key facet of MessageBird’s business is its carrier partnerships, and the company claims 220 direct carrier integrations globally. With its own telecommunications carrier infrastructure, MessageBird can “connect to the very core of mobile carriers,” according to Vis. This effectively bypasses legacy systems that may involve multiple players and which may not be reliable. Generally speaking, the more entities involved in getting a message from A to B, the more likely there will be delays or failures. One analogy Vis used to describe its setup is the game “telephone” (or “", "Chinese whispers", "” as its known elsewhere), whereby a message is whispered into one person’s ear and then passed along to the next person until the last player in the group repeats a message that is unrecognizable to the initial whisper.", "“The same holds true for communications,” said Vis. “Because of our direct carrier connections, MessageBird is essentially whispering in the last person’s ear, bypassing all the people in the middle. Other companies go through all those extra hoops, and as a result security is compromised, quality is diminished, and speed is slowed — and now imagine you had to pay all those people who passed along the message. That is what happens in communications.”", "One interesting facet of MessageBird’s recent past is its participation in the American seed-stage accelerator program, Y Combinator (YC). Though MessageBird was technically a seed-stage company in terms of funding, YC is generally geared toward early-stage startups — not companies that are already generating millions in revenue. So what was the story behind the YC tie-up?", "“We were growing so fast that it afforded us a moment to reflect and fine-tune our vision as to where we wanted to go as a company,” Vis said. “It also provided us with a huge network of portfolio companies we saw as potential customers in the U.S. market. The way I look at YC, it’s more like Harvard for founders, where they really drill you on focus and basics that apply to companies at any stage.”", "One specific learning that Vis gleaned from his company’s involvement with YC was a mantra stipulating that “growth” is about retaining customers, not just acquiring them. “It seems really logical, but it changed the way we looked at customer success, and we increased our revenue expansion rate from 140 percent prior to YC to 170 percent after it,” he said. “I’m a huge advocate for companies joining YC at any stage, especially larger companies outside of the U.S. wanting to enter the U.S. market.”", "MessageBird now lays claim to the biggest-ever series A investment for a Y Combinator company.", "“While many companies have significant traction when they enter YC, MessageBird was one of the largest companies by revenue to ever complete the program,” added Y Combinator partner Ali Rowghani.", "Today, MessageBird has offices in its native Amsterdam, as well as in San Francisco, Singapore, and Sydney. In addition to funding its push into voice, the company said it will use its fresh cash bounty to fund new hires, including in customer support, and to consider acquisition options in the U.S., Europe, and Asia.", "One luxury of being a self-funded startup is that you don’t have to worry about exits — being acquired or going public doesn’t matter if you’re getting customers and garnering revenue. While this funding helps MessageBird scale in key markets such as the U.S., doesn’t it also give them an extra problem to worry about?", "“We specifically chose investors who have a long-term vision and will not put pressure on us to think about this [exiting] for a while,” said Vis. “It happens to be that ", "both investors", " just ", "raised their investment funds", ", so we are good for the next 10 years to not have to worry about this. It’s also super early days for the cloud communication space. This is such a large market — that is still dominated by incumbents — that there will be enough time to grow significantly.”"]}
{"article_id": "post-2280592", "artile_title": "Microsoft resuscitates AltspaceVR for social mixed reality", "story_url": "https://venturebeat.com/2017/10/03/microsoft-resuscitates-altspacevr-for-social-mixed-reality/", "time": "2017-10-03T11:01:06+00:00", "author": "Dean Takahashi", "content": ["Microsoft announced today that it has acquired the AltspaceVR team as it announced its big initiative to created a hardware and software ecosystem around Windows mixed reality headsets.", "Microsoft didn’t explain the terms of the deal, ", "saying only that AltspaceVR is joining Microsoft", ". Microsoft calls the emerging technology “mixed reality” to encompass both augmented reality headsets, such as its own HoloLens, and virtual reality headsets.", "When ", "AltspaceVR shut down in July", ", it seemed like the glory days of VR were over, as other well-known startups such as Envelop VR were also closing. But the fledgling industry is full of winners and losers, some of which are still raising money. Now it seems like the glory days are back, with Microsoft moving in to save the day.", "AltspaceVR was founded by Eric Romo in his home office in 2013. He wanted to create a social space in the emerging medium of virtual reality.", "The company raised $10.3 million in 2015 from Comcast Ventures, Tencent, Dolby Family Ventures, Raine Ventures, Lux Capital, Western Technology Investments, Maven Ventures, Promus Ventures, Streamlined Ventures, and Rothenberg Ventures. Rivals include Rec Room, Roblox, Linden Lab, and TheWaveVR.", "Above: Eric Romo, CEO of AltspaceVR at SVVR.", "Things seemed to be going well at first, but VR itself had a big hiccup. VR didn’t meet expectations for sales, since PC-based systems were pretty expensive during the launch year of 2016. VR mobile and PC headsets are forecast to grow from 6.4 million units to 20.3 million in 2017, according to SuperData Research. All told, AltspaceVR had only 35,000 users a month using its app.", "In a July 28 ", "blog post", ", the company said it ran into “unforeseen financial difficulty” and couldn’t afford to “keep the virtual lights on anymore.” The post said the company tried to raise a new round of funding but a deal fell through and it ran out of time and money. It added: “We’d love to see this technology, if not the company, live on in some way, and we’re working on that.”"]}
{"article_id": "post-2281009", "artile_title": "Level Ex raises $11 million for a real surgeon simulator", "story_url": "https://venturebeat.com/2017/10/03/level-ex-raises-11-million-for-a-real-surgeon-simulator/", "time": "2017-10-03T22:00:06+00:00", "author": "Stephanie Chan", "content": ["Developer Level Ex raised $11 million in a Series A round of financing to continue creating games that are aimed at replicating operating room scenarios. It previously created the virtual surgery training app ", "Airway Ex", ", and with the funds it’s just raised, it will also start to experiment with augmented reality and virtual reality. The iOS version of Airway Ex already has some AR in it thanks to Apple’s ARKit.", "“Our main focus with the Series A funding will be to expand our mobile apps as the mobile device is one of the most convenient and accessible training modalities that will ever be adopted by doctors,” said Sam Glassenberg, Level Ex’s CEO, in an email to GamesBeat. “Additionally, we plan to expand our AR and VR titles based on our market demand coming in from the medical device and pharma industry, and medical societies interested in these technologies as a new format for continuing medical education.”", "Level Ex will be adding more cases to the Airway Ex app, and it will also start working on games that will cover other specialties, such as gastroenterology and cardiology. Glassenberg says that AR and VR offer a lot of exciting opportunities, with different use cases for people in the medical profession.", "“Ultimately, I believe AR will be more useful in the operating room whereas VR will see more application and utility in medical training,” says Glassenberg. “With AR, a surgeon can project pre-op MRI scan data on top of a patient on the operating table — to effectively ‘see through’ the patient during surgery. Applications like this will aid surgeons to to be more accurate when operating on patients.”", "VR, on the other hand, is immersive and can re-create the high-pressure environment of the operating room and help train professionals on a variety of situations.", "Glassenberg says that they do a lot of user testing to make sure the controls in apps like Airway Ex are intuitive. They also consult medical advisors, who help ensure that the experience is still educational and informative for doctors. Level Ex’s developers also reference the sounds and appearance of operating rooms to mimic reality as closely as possible.", "“Our game developers study in-depth the devices and clinical environments doctors practice within,” said Glassenberg. “The presentation of realistic patient anatomy, exact details of device specs, including camera visuals, and sounds of machines in the [operating room] bring a sense of familiarity and intuitiveness to the game. By the first few cases, doctors across the board get it, and shift into game-play mode, performing procedures and tackling the challenges being presented to them in the game.”", "The feedback from medical professionals has so far been positive. Glassenberg says they’re seeing a session length of about 12 minutes on average. This is higher than other mobile games, which are reported to be about 7 minutes or so per session on average, according to ", "TechCrunch", ".", "“They are always amazed that they are able to see such a high level of realism from their mobile device,” said Glassenberg. “It’s exciting to see doctors jump when our virtual patients breathe, bleed, and cough based on their actions in the app. Not only do we hear such positive feedback when we talk to doctors, but we see it from our data. Doctors replay cases over and over to master a technique, earn a high score, or compete against a colleague.”"]}
{"article_id": "post-2281087", "artile_title": "FogHorn raises $30 million to provide IoT edge computing analytics", "story_url": "https://venturebeat.com/2017/10/04/foghorn-raises-30-million-to-provide-iot-edge-computing-analytics/", "time": "2017-10-04T09:00:31+00:00", "author": "Bérénice Magistretti", "content": ["FogHorn", ", which provides data analytics software for industrial and commercial Internet of Things (IoT) applications, announced today that is has secured $30 million in funding. Intel Capital and Saudi Aramco Energy Ventures co-led this round, with new investor Honeywell Ventures joining in. All previous investors also participated, including March Capital, GE, Dell, Bosch, Yokogawa, Darling Ventures, and The Hive.", "“In the industrial application of IoT, such as manufacturing facilities, oil and gas production sites, and transportation systems, there are often hundreds or thousands of physical and video/audio sensors continuously producing a massive amount of high velocity data,” wrote FogHorn CEO David King, in an email to VentureBeat. “This data is being collected at the network ‘edge’, what Cisco coined the ‘fog’ layer several years ago.”", "Edge computing", " is a method of optimizing cloud computing systems by performing data processing at the edge of the network, near the source of the data. According to King, industrial operators face several challenges when collecting and processing data, including a high volume of data-collecting sources, high costs in transporting this data in the cloud, and limits to real-time insights.", "While latency may be fine when you are conversing with Amazon’s Alexa, having a delayed response to a gas leak could be extremely dangerous.", "FogHorn’s Lighting platform has been purpose-built to run in very small footprint (256MB or smaller) edge computing systems. “The reason this is important is that the vast majority of data streaming from IoT sensors is useless within a very short period of time,” wrote King. “The information that is valuable — the anomalies and hard-to-detect patterns — need to be acted upon while operators can take corrective action.”", "FogHorn licenses its software on a subscription basis to dozens of customers, according to King. The chief executive does not see any direct competitors focusing solely on tapping into streaming edge data for analytics, machine learning, and AI. “Amazon Greengrass and Microsoft Azure Edge are now targeting the edge with reduced footprint versions of their heavy cloud software stacks, but both still send most data to the cloud for advanced data science functionality,” he added.", "The investment from Saudi Aramco Energy Ventures should secure FogHorn’s foothold in Saudi Arabia, which is one of the world’s biggest oil producers.", "“Given the heavy presence of oil and gas, we expect it to be a large market in the future,” wrote King. “By partnering with Saudi Aramco Energy Ventures, we’re just beginning our reach into this market.”", "To date, FogHorn has raised a total of $47.5 million. The Mountain View, California-based startup will use the fresh injection of capital to hire more engineers and increase sales and marketing efforts.", "Founded in 2014 as part of The Hive incubator, FogHorn currently has more than 40 employees."]}
